
var App = new Ext.App({});

//Example data
var gridData = [
    [1, '2015-11-09', 60, '2015-11-09', 90000, 7, 108000, 'completed'],
    [2, '2014-05-01', 72, '2016-05-01', 70000, 10, 98000, 'issued'],
    [3, '2014-06-11', 81, '2015-06-22', 100000, 8, 140000, 'issued'],
    [4, '2014-06-27', 60, '2016-08-14', 60000, 10, 98000, 'completed'],
    [5, '2014-05-01', 80, '2016-05-01', 95000, 8, 125000, 'completed'],
    [6, '2015-11-09', 60, '2015-11-09', 90000, 7, 108000, 'completed'],
    [7, '2014-05-01', 72, '2016-05-01', 70000, 10, 98000, 'issued'],
    [8, '2014-06-11', 81, '2015-06-22', 100000, 8, 140000, 'issued'],
    [9, '2014-06-27', 60, '2016-08-14', 60000, 10, 98000, 'completed'],
    [10, '2015-11-09', 60, '2015-11-09', 90000, 7, 108000, 'completed'],
    [11, '2014-05-01', 72, '2016-05-01', 70000, 10, 98000, 'completed'],
    [12, '2014-06-11', 81, '2015-06-22', 100000, 8, 140000, 'issued']
];

Ext.onReady(function(){
    
    Ext.QuickTips.init();
    
    App.clientsGrid = Ext.create({
        xtype: 'app-clients-grid',
        title: 'История займов по заемщику'
    });
    
    App.clientsGrid.store.loadData( gridData );
    App.clientsGrid.render('app');
    
});
